app/controllers/api/feeds_controller.rb

  def index
    # render :json => Feed.all
    @feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
    # render :json => Feed.find(params[:id]), include: :latest_entries
    @feed = Feed.find(params[:id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url_and_user_id(feed_params[:url], current_user.id)
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://feeds.abcnews.com/abcnews/entertainmentheadlines' AND "feeds"."user_id" = 2 LIMIT 1

  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 5]]