app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries