app/views/api/feeds/show.json.jbuilder

json.title @feed.title
json.updated_at @feed.updated_at
---
UPDATE "feeds" SET "updated_at" = '2015-07-09 16:24:42.650500' WHERE "feeds"."id" = 1